[
	{
		"title": "Start",
		"tags": "",
		"body": "[b]Hello Player.[/b] 👋 Thank goodness my call reached Earth. I am a scientist trapped inside this base after an alien invasion. I call these creatures bugs, and trust me, they are as ugly as they are dangerous. Earth has sent you as my hero. Your mission is simple but risky. Reach the checkpoint at the far end of the base, where a spaceship is waiting. Get inside it, and we can finally go home.\nBe careful around the bugs. If you move too close, they will chase you. They can damage you if they attack, but your special suit will eventually destroy them as well. Stay alert, move smart, and good luck, Player.\nPress [b]Backspace[/b] or [b]Exit Button[/b] on top to move to game. Or Press Space to discover About me 🙂.\nI am Asjad Ilahi, a [b]Software Engineering[/b] student and freelance developer passionate about building practical, user focused digital products. I specialize in transforming ideas into scalable applications with clean architecture, intuitive UI, and strong performance. My work blends problem solving, system design, and creativity to deliver real world impact across web, mobile, and interactive platforms. [b]Here Are Some Of My  Projects[/b] 👉\n[b]Academora[/b] – A MERN based student community platform designed to help students connect, share knowledge, explore universities, and engage through campaigns, societies, and discussions. [b]Petlove[/b] – A Flutter powered e commerce application for pet food and accessories, delivering a smooth shopping experience with Firebase backend and cross platform deployment. [b]SaazGhar[/b] – An AI driven pre construction platform that converts 2D house plans into interactive 3D designs while estimating costs, materials, and connecting users with verified vendors.\n [b]Taabaawi[/b] – A Flutter based tactical gear e commerce app built for Android and iOS, featuring secure authentication, product management, and real time data handling. [b]WowCouple[/b] – A matrimonial mobile application focused on meaningful matchmaking, enhanced with intuitive UI UX and Firebase powered data management. [b]Wafferli[/b] – A Next.js web application for Kuwait based E-commerce Solution.\nI have worked as a freelance mobile, web, and UI UX developer, delivering full stack solutions for startups and individual clients. My experience includes [b]Flutter[/b] app development for Android and iOS, [b]MERN[/b] and [b]Next.js[/b] web applications, Firebase based backends, payment integrations, real time features, and designing complete UI UX systems using [b]Figma[/b] from wireframes to final designs.\nFlutter and Dart for mobile development, MERN Stack and Next.js for web applications, Firebase, MongoDB, Supabase, REST APIs, JavaScript, Python, Java, PHP, Figma for UI UX design, Git and GitHub for version control, and strong communication and problem solving skills.\nThanks For Reading 😍. Press the Exit button or Backspace to continue Game.\n\n",
		"position": {
			"x": 428,
			"y": 245
		},
		"colorID": 0
	}
]